%% 실습문제 4.1

clear, clc

a = [12 17 3 6]
b = [5 8 3
    1 2 3
    2 4 6]
c = [22
    17
    4]

% 1. 변수 x1에 행렬 a의 2번째 열에 있는 원소의 값을 할당하라.
x1 = a(2)

% 2. 변수 x2에는 행렬 b의 3번째 열을 할당하라.
x2 = b(:, 3)

% 3. 변수 x3에는 행렬 b의 3번째 행을 할당하라.
x3 = b(3, :)

% 4. 변수 x4에는 행렬 b의 대각선 방향을 따라 있는 원소의 값을 할당하라.
x4 = [b(1, 1) b(2, 2) b(3, 3)]

% 5. 변수 x5에는 행렬 a의 처음 3개의 값이 첫 번째 행이 되고, 행렬 b의 모든 값들이 2행부터 4행까지가 되도록 할당하라.
x5 = [a(1:3)
    b]

% 6. 변수 x6에는 행렬 c에 있는 값들이 1열이 되고, 행렬 b에 있는 열들이 2, 3, 4열이 되며, 행렬 a에 있는 값들이 마지막 행이 되도록 할당하라.
x6 = [c,b
    a]

% 7. 한 개의 인덱스 번호를 사용하여 변수 x7에 행렬 b의 8번째 원소의 값을 할당하라.
x7 = b(8)

% 8. 행렬 b를 x8이란 이름의 열 벡터로 변환하라.
x8 = b(:)