%% 범용 수학함수

% abs(x)       x의 절댓값
% sqrt(x)      x의 제곱근
% nthroot(x,n) x의 n제곱근
% sign(x)      x의 양·음·0 판별
% rem(x,y)     x를 y로 나눈 나머지
% exp(x)       e의 x제곱
% log(x)       x의 자연로그(ln, 밑수는 e)
% log10(x)     x의 상용로그(밑수는 10)

abs(-2026)

%% 근사 함수

% round(x)    x에 가장 가까운 정수 (=반올림)
% round(x, N) 소수점 아래 N자릿수로 x에 가장 가까운 근삿값 구함
% fix(x)      0 방향으로 x에 가장 가까운 정수
% floor(x)    음의 무한대 방향으로 x에 가장 가까운 정수
% ceil(x)     양의 무한대 방향으로 x에 가장 가까운 정수

%% 이산수학(discrete mathematics)용 함수

% PDF 자료 참고

%% 삼각함수 관련 함수
% sind()와 asind() 등 제외하고는 기본적으로 라디안(rad) 단위 사용됨에 주의

% PDF 자료 참고

%% 데이터 분석 함수
% [a, b] = max(x)의 경우 MATLAB은 0, 1, ... 순서가 아닌 1, 2, ... 순서로 출력함에 주의

% PDF 자료 참고

%% 기타

% doc [x]      x 함수의 설명서

% 2.2026e+004는 2.2026 * 10^4의 공학적 표기
% 2.2026e-004는 2.2026 * 10^-4의 공학적 표기